oxfrd/STM32L476G_l3gd20/Core/Inc/l3gd20h_reg.h
/*
 ******************************************************************************
 * @file    l3gd20h_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          l3gd20h_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef L3GD20H_REGS_H
#define L3GD20H_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup L3GD20H
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7       : 1;
  uint8_t bit6       : 1;
  uint8_t bit5       : 1;
  uint8_t bit4       : 1;
  uint8_t bit3       : 1;
  uint8_t bit2       : 1;
  uint8_t bit1       : 1;
  uint8_t bit0       : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, uint8_t *,
                                    uint16_t);
typedef int32_t (*stmdev_read_ptr) (void *, uint8_t, uint8_t *,
                                    uint16_t);

typedef struct {
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct {
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup L3GD20H_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> 0xD5 if SA0=1 -> 0xD7 **/
#define L3GD20H_I2C_ADD_L     0xD5U
#define L3GD20H_I2C_ADD_H     0xD7U

/** Device Identification (Who am I) **/
#define L3GD20H_ID            0xD4U 	//for l3gd20

/**
  * @}
  *
  */

#define L3GD20H_WHO_AM_I                0x0FU
#define L3GD20H_CTRL1                   0x20U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xen                 : 1;
  uint8_t yen                 : 1;
  uint8_t zen                 : 1;
  uint8_t pd                  : 1;
  uint8_t bw                  : 2;
  uint8_t dr                  : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dr                  : 2;
  uint8_t bw                  : 2;
  uint8_t pd                  : 1;
  uint8_t zen                 : 1;
  uint8_t yen                 : 1;
  uint8_t xen                 : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ctrl1_t;

#define L3GD20H_CTRL2                   0x21U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t hpcf                : 4;
  uint8_t hpm                 : 2;
  uint8_t lvlen               : 1;
  uint8_t extren              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t extren              : 1;
  uint8_t lvlen               : 1;
  uint8_t hpm                 : 2;
  uint8_t hpcf                : 4;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ctrl2_t;

#define L3GD20H_CTRL3                   0x22U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_empty          : 1;
  uint8_t int2_orun           : 1;
  uint8_t int2_fth            : 1;
  uint8_t int2_drdy           : 1;
  uint8_t pp_od               : 1;
  uint8_t h_lactive           : 1;
  uint8_t int1_boot           : 1;
  uint8_t int1_ig             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_ig             : 1;
  uint8_t int1_boot           : 1;
  uint8_t h_lactive           : 1;
  uint8_t pp_od               : 1;
  uint8_t int2_drdy           : 1;
  uint8_t int2_fth            : 1;
  uint8_t int2_orun           : 1;
  uint8_t int2_empty          : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ctrl3_t;

#define L3GD20H_CTRL4                   0x23U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sim                 : 1;
  uint8_t st                  : 2;
  uint8_t impen               : 1;
  uint8_t fs                  : 2;
  uint8_t ble                 : 1;
  uint8_t bdu                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bdu                 : 1;
  uint8_t ble                 : 1;
  uint8_t fs                  : 2;
  uint8_t impen               : 1;
  uint8_t st                  : 2;
  uint8_t sim                 : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ctrl4_t;

