oxfrd/STM32L476G_l3gd20/Core/Inc/l3gd20h_reg.h
#define L3GD20H_CTRL5                   0x24U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t out_sel             : 2;
  uint8_t ig_sel              : 2;
  uint8_t hpen                : 1;
  uint8_t stoponfth           : 1;
  uint8_t fifo_en             : 1;
  uint8_t boot                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                : 1;
  uint8_t fifo_en             : 1;
  uint8_t stoponfth           : 1;
  uint8_t hpen                : 1;
  uint8_t ig_sel              : 2;
  uint8_t out_sel             : 2;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ctrl5_t;

#define L3GD20H_REFERENCE               0x25U
#define L3GD20H_OUT_TEMP                0x26U
#define L3GD20H_STATUS                  0x27U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xda                 : 1;
  uint8_t yda                 : 1;
  uint8_t zda                 : 1;
  uint8_t zyxda               : 1;
  uint8_t _xor                : 1;
  uint8_t yor                 : 1;
  uint8_t zor                 : 1;
  uint8_t zyxor               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t zyxor               : 1;
  uint8_t zor                 : 1;
  uint8_t yor                 : 1;
  uint8_t _xor                : 1;
  uint8_t zyxda               : 1;
  uint8_t zda                 : 1;
  uint8_t yda                 : 1;
  uint8_t xda                 : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_status_t;

#define L3GD20H_OUT_X_L                 0x28U
#define L3GD20H_OUT_X_H                 0x29U
#define L3GD20H_OUT_Y_L                 0x2AU
#define L3GD20H_OUT_Y_H                 0x2BU
#define L3GD20H_OUT_Z_L                 0x2CU
#define L3GD20H_OUT_Z_H                 0x2DU
#define L3GD20H_FIFO_CTRL               0x2EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fth                 : 5;
  uint8_t fm                  : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fm                  : 3;
  uint8_t fth                 : 5;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_fifo_ctrl_t;

#define L3GD20H_FIFO_SRC                0x2FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fss                 : 5;
  uint8_t empty               : 1;
  uint8_t ovrn                : 1;
  uint8_t fth                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fth                 : 1;
  uint8_t ovrn                : 1;
  uint8_t empty               : 1;
  uint8_t fss                 : 5;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_fifo_src_t;

#define L3GD20H_IG_CFG                  0x30U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xlie                : 1;
  uint8_t xhie                : 1;
  uint8_t ylie                : 1;
  uint8_t yhie                : 1;
  uint8_t zlie                : 1;
  uint8_t zhie                : 1;
  uint8_t lir                 : 1;
  uint8_t and_or              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t and_or              : 1;
  uint8_t lir                 : 1;
  uint8_t zhie                : 1;
  uint8_t zlie                : 1;
  uint8_t yhie                : 1;
  uint8_t ylie                : 1;
  uint8_t xhie                : 1;
  uint8_t xlie                : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_cfg_t;

#define L3GD20H_IG_SRC                  0x31U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t xl                  : 1;
  uint8_t xh                  : 1;
  uint8_t yl                  : 1;
  uint8_t yh                  : 1;
  uint8_t zl                  : 1;
  uint8_t zh                  : 1;
  uint8_t ia                  : 1;
  uint8_t not_used_01         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01         : 1;
  uint8_t ia                  : 1;
  uint8_t zh                  : 1;
  uint8_t zl                  : 1;
  uint8_t yh                  : 1;
  uint8_t yl                  : 1;
  uint8_t xh                  : 1;
  uint8_t xl                  : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_src_t;

#define L3GD20H_IG_THS_XH               0x32U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t thsx                : 7;
  uint8_t dcrm                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dcrm                : 1;
  uint8_t thsx                : 7;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_ths_xh_t;

#define L3GD20H_IG_THS_XL               0x33U
typedef struct {
  uint8_t thsx                : 8;
} l3gd20h_ig_ths_xl_t;

#define L3GD20H_IG_THS_YH               0x34U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t thsy                : 7;
  uint8_t not_used_01         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01         : 1;
  uint8_t thsy                : 7;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_ths_yh_t;

#define L3GD20H_IG_THS_YL               0x35U
typedef struct {
  uint8_t thsy                : 8;
} l3gd20h_ig_ths_yl_t;

#define L3GD20H_IG_THS_ZH               0x36U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t thsz                : 7;
  uint8_t not_used_01         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01         : 1;
  uint8_t thsz                : 7;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_ths_zh_t;

#define L3GD20H_IG_THS_ZL               0x37U
typedef struct {
  uint8_t thsz                : 8;
} l3gd20h_ig_ths_zl_t;

#define L3GD20H_IG_DURATION             0x38U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t d                   : 7;
  uint8_t wait                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wait                : 1;
  uint8_t d                   : 7;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_ig_duration_t;

#define L3GD20H_LOW_ODR                 0x39U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t low_odr             : 1;
  uint8_t not_used_01         : 1;
  uint8_t sw_res              : 1;
  uint8_t i2c_dis             : 1;
  uint8_t not_used_02         : 1;
  uint8_t drdy_hl             : 1;
  uint8_t not_used_03         : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_03         : 2;
  uint8_t drdy_hl             : 1;
  uint8_t not_used_02         : 1;
  uint8_t i2c_dis             : 1;
  uint8_t sw_res              : 1;
  uint8_t not_used_01         : 1;
  uint8_t low_odr             : 1;
#endif /* DRV_BYTE_ORDER */
} l3gd20h_low_odr_t;

/**
  * @defgroup L3GD20H_Register_Union
  * @brief    This union group all the registers that has a bit-field
  *           description.
  *           This union is useful but not need by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union {
  l3gd20h_ctrl1_t             ctrl1;
  l3gd20h_ctrl2_t             ctrl2;
  l3gd20h_ctrl3_t             ctrl3;
  l3gd20h_ctrl4_t             ctrl4;
  l3gd20h_ctrl5_t             ctrl5;
  l3gd20h_status_t            status;
  l3gd20h_fifo_ctrl_t         fifo_ctrl;
  l3gd20h_fifo_src_t          fifo_src;
  l3gd20h_ig_cfg_t            ig_cfg;
  l3gd20h_ig_src_t            ig_src;
  l3gd20h_ig_ths_xh_t         ig_ths_xh;
  l3gd20h_ig_ths_xl_t         ig_ths_xl;
  l3gd20h_ig_ths_yh_t         ig_ths_yh;
  l3gd20h_ig_ths_yl_t         ig_ths_yl;
  l3gd20h_ig_ths_zh_t         ig_ths_zh;
  l3gd20h_ig_ths_zl_t         ig_ths_zl;
  l3gd20h_ig_duration_t       ig_duration;
  l3gd20h_low_odr_t           low_odr;
  bitwise_t                   bitwise;
  uint8_t                     byte;
} l3gd20h_reg_t;

/**
  * @}
  *
  */

