oxfrd/STM32L476G_l3gd20/Core/Inc/l3gd20h_reg.h
int32_t l3gd20h_read_reg(stmdev_ctx_t *ctx, uint8_t reg,
                         uint8_t *data,
                         uint16_t len);
int32_t l3gd20h_write_reg(stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);

float_t l3gd20h_from_fs245_to_mdps(int16_t lsb);
float_t l3gd20h_from_fs500_to_mdps(int16_t lsb);
float_t l3gd20h_from_fs2000_to_mdps(int16_t lsb);

float_t l3gd20h_from_lsb_to_celsius(int16_t lsb);

typedef struct {
  uint8_t xen             : 1;
  uint8_t yen             : 1;
  uint8_t zen             : 1;
} l3gd20h_gy_axis_t;
int32_t l3gd20h_gy_axis_set(stmdev_ctx_t *ctx, l3gd20h_gy_axis_t val);
int32_t l3gd20h_gy_axis_get(stmdev_ctx_t *ctx,
                            l3gd20h_gy_axis_t *val);

typedef enum {
  L3GD20H_POWER_DOWN    = 0x00,
  L3GD20H_12Hz5         = 0x90,
  L3GD20H_25Hz          = 0x91,
  L3GD20H_50Hz          = 0x92,
  L3GD20H_100Hz         = 0x80,
  L3GD20H_200Hz         = 0x81,
  L3GD20H_400Hz         = 0x82,
  L3GD20H_800Hz         = 0x83,
} l3gd20h_gy_data_rate_t;
int32_t l3gd20h_gy_data_rate_set(stmdev_ctx_t *ctx,
                                 l3gd20h_gy_data_rate_t val);
int32_t l3gd20h_gy_data_rate_get(stmdev_ctx_t *ctx,
                                 l3gd20h_gy_data_rate_t *val);


typedef enum {
  L3GD20H_245dps    = 0x00,
  L3GD20H_500dps    = 0x01,
  L3GD20H_2000dps   = 0x02,
} l3gd20h_gy_fs_t;
int32_t l3gd20h_gy_full_scale_set(stmdev_ctx_t *ctx,
                                  l3gd20h_gy_fs_t val);
int32_t l3gd20h_gy_full_scale_get(stmdev_ctx_t *ctx,
                                  l3gd20h_gy_fs_t *val);

int32_t l3gd20h_block_data_update_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t l3gd20h_block_data_update_get(stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t l3gd20h_gy_flag_data_ready_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t l3gd20h_temperature_raw_get(stmdev_ctx_t *ctx, uint8_t *buff);

int32_t l3gd20h_angular_rate_raw_get(stmdev_ctx_t *ctx, int16_t *val,uint8_t *buff);

int32_t l3gd20h_dev_id_get(stmdev_ctx_t *ctx, uint8_t *buff);

typedef enum {
  L3GD20H_LSB_LOW_ADDRESS = 0,
  L3GD20H_MSB_LOW_ADDRESS = 1,
} l3gd20h_ble_t;
int32_t l3gd20h_dev_data_format_set(stmdev_ctx_t *ctx,
                                    l3gd20h_ble_t val);
int32_t l3gd20h_dev_data_format_get(stmdev_ctx_t *ctx,
                                    l3gd20h_ble_t *val);

int32_t l3gd20h_dev_boot_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t l3gd20h_dev_boot_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t xda               : 1;
  uint8_t yda               : 1;
  uint8_t zda               : 1;
  uint8_t zyxda             : 1;
  uint8_t _xor              : 1;
  uint8_t yor               : 1;
  uint8_t zor               : 1;
  uint8_t zyxor             : 1;
} l3gd20h_status_reg_t;
int32_t l3gd20h_dev_status_get(stmdev_ctx_t *ctx,
                               l3gd20h_status_reg_t *val);

int32_t l3gd20h_dev_reset_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t l3gd20h_dev_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  L3GD20H_16Hz6_USE_ODR_50Hz      = 0xA0,
  L3GD20H_12Hz5_USE_ODR_100Hz     = 0x00,
  L3GD20H_25Hz_USE_ODR_100Hz      = 0x01,
  L3GD20H_12Hz5_USE_ODR_200Hz     = 0x10,
  L3GD20H_70Hz_USE_ODR_200Hz      = 0x13,
  L3GD20H_20Hz_USE_ODR_400Hz      = 0x20,
  L3GD20H_25Hz_USE_ODR_400Hz      = 0x21,
  L3GD20H_50Hz_USE_ODR_400Hz      = 0x22,
  L3GD20H_110Hz_USE_ODR_400Hz     = 0x23,
  L3GD20H_30Hz_USE_ODR_800Hz      = 0x30,
  L3GD20H_35Hz_USE_ODR_800Hz      = 0x31,
  L3GD20H_100Hz_USE_ODR_800Hz     = 0x33,
} l3gd20h_lpbw_t;
int32_t l3gd20h_gy_filter_lp_bandwidth_set(stmdev_ctx_t *ctx,
                                           l3gd20h_lpbw_t val);
int32_t l3gd20h_gy_filter_lp_bandwidth_get(stmdev_ctx_t *ctx,
                                           l3gd20h_lpbw_t *val);

typedef enum {
  L3GD20H_NORMAL_MODE_LIGHT      = 0x00,
  L3GD20H_NORMAL_MODE_NORMAL     = 0x01,
  L3GD20H_NORMAL_MODE_STRONG     = 0x02,
  L3GD20H_NORMAL_MODE_EXTREME    = 0x03,
  L3GD20H_USE_REFERENCE_LIGHT    = 0x10,
  L3GD20H_USE_REFERENCE_NORMAL   = 0x11,
  L3GD20H_USE_REFERENCE_STRONG   = 0x12,
  L3GD20H_USE_REFERENCE_EXTREME  = 0x13,
  L3GD20H_AUTORESET_LIGHT        = 0x30,
  L3GD20H_AUTORESET_NORMAL       = 0x31,
  L3GD20H_AUTORESET_STRONG       = 0x32,
  L3GD20H_AUTORESET_EXTREME      = 0x33,
} l3gd20h_gy_hp_bw_t;
int32_t l3gd20h_gy_filter_hp_bandwidth_set(stmdev_ctx_t *ctx,
                                           l3gd20h_gy_hp_bw_t val);
int32_t l3gd20h_gy_filter_hp_bandwidth_get(stmdev_ctx_t *ctx,
                                           l3gd20h_gy_hp_bw_t *val);

typedef enum {
  L3GD20H_LPF1_OUT           = 0x00,
  L3GD20H_LPF1_HPF_OUT       = 0x11,
  L3GD20H_LPF1_LPF2_OUT      = 0x02,
  L3GD20H_LPF1_HPF_LPF2_OUT  = 0x12,
} l3gd20h_gy_out_path_t;
int32_t l3gd20h_gy_filter_out_path_set(stmdev_ctx_t *ctx,
                                       l3gd20h_gy_out_path_t val);
int32_t l3gd20h_gy_filter_out_path_get(stmdev_ctx_t *ctx,
                                       l3gd20h_gy_out_path_t *val);
typedef enum {
  L3GD20H_LPF1_INT           = 0x00,
  L3GD20H_LPF1_HPF_INT       = 0x11,
  L3GD20H_LPF1_LPF2_INT      = 0x02,
  L3GD20H_LPF1_HPF_LPF2_INT  = 0x12,
} l3gd20h_gy_int_path_t;
int32_t l3gd20h_gy_filter_int_path_set(stmdev_ctx_t *ctx,
                                       l3gd20h_gy_int_path_t val);
int32_t l3gd20h_gy_filter_int_path_get(stmdev_ctx_t *ctx,
                                       l3gd20h_gy_int_path_t *val);

int32_t l3gd20h_gy_filter_reference_set(stmdev_ctx_t *ctx,
                                        uint8_t *buff);
int32_t l3gd20h_gy_filter_reference_get(stmdev_ctx_t *ctx,
                                        uint8_t *buff);

typedef enum {
  L3GD20H_SPI_4_WIRE = 0,
  L3GD20H_SPI_3_WIRE = 1,
} l3gd20h_sim_t;
int32_t l3gd20h_spi_mode_set(stmdev_ctx_t *ctx, l3gd20h_sim_t val);
int32_t l3gd20h_spi_mode_get(stmdev_ctx_t *ctx, l3gd20h_sim_t *val);

