oxfrd/STM32L476G_l3gd20/Core/Inc/l3gd20h_reg.h
typedef enum {
  L3GD20H_I2C_ENABLE  = 0,
  L3GD20H_I2C_DISABLE = 1,
} l3gd20h_i2c_dis_t;
int32_t l3gd20h_i2c_interface_set(stmdev_ctx_t *ctx,
                                  l3gd20h_i2c_dis_t val);
int32_t l3gd20h_i2c_interface_get(stmdev_ctx_t *ctx,
                                  l3gd20h_i2c_dis_t *val);

typedef struct {
  uint8_t int2_empty            : 1;
  uint8_t int2_orun             : 1;
  uint8_t int2_fth              : 1;
  uint8_t int2_drdy             : 1;
} l3gd20h_pin_int2_rt_t;
int32_t l3gd20h_pin_int2_route_set(stmdev_ctx_t *ctx,
                                   l3gd20h_pin_int2_rt_t val);
int32_t l3gd20h_pin_int2_route_get(stmdev_ctx_t *ctx,
                                   l3gd20h_pin_int2_rt_t *val);

typedef enum {
  L3GD20H_PUSH_PULL  = 0,
  L3GD20H_OPEN_DRAIN = 1,
} l3gd20h_pp_od_t;
int32_t l3gd20h_pin_mode_set(stmdev_ctx_t *ctx, l3gd20h_pp_od_t val);
int32_t l3gd20h_pin_mode_get(stmdev_ctx_t *ctx, l3gd20h_pp_od_t *val);

typedef enum {
  L3GD20H_ACTIVE_HIGH = 0,
  L3GD20H_ACTIVE_LOW  = 1,
} l3gd20h_pin_pol_t;
int32_t l3gd20h_pin_polarity_set(stmdev_ctx_t *ctx,
                                 l3gd20h_pin_pol_t val);
int32_t l3gd20h_pin_polarity_get(stmdev_ctx_t *ctx,
                                 l3gd20h_pin_pol_t *val);

typedef struct {
  uint8_t int1_boot           : 1;
  uint8_t int1_ig             : 1;
} l3gd20h_pin_int1_rt_t;
int32_t l3gd20h_pin_int1_route_set(stmdev_ctx_t *ctx,
                                   l3gd20h_pin_int1_rt_t val);
int32_t l3gd20h_pin_int1_route_get(stmdev_ctx_t *ctx,
                                   l3gd20h_pin_int1_rt_t *val);

typedef enum {
  L3GD20H_INT_PULSED  = 0,
  L3GD20H_INT_LATCHED = 1,
} l3gd20h_lir_t;
int32_t l3gd20h_pin_notification_set(stmdev_ctx_t *ctx,
                                     l3gd20h_lir_t val);
int32_t l3gd20h_pin_notification_get(stmdev_ctx_t *ctx,
                                     l3gd20h_lir_t *val);
typedef enum {
  L3GD20H_LOGIC_OR  = 0,
  L3GD20H_LOGIC_AND = 1,
} l3gd20h_pin_logic_t;
int32_t l3gd20h_pin_logic_set(stmdev_ctx_t *ctx,
                              l3gd20h_pin_logic_t val);
int32_t l3gd20h_pin_logic_get(stmdev_ctx_t *ctx,
                              l3gd20h_pin_logic_t *val);

typedef struct {
  uint8_t xlie             : 1;
  uint8_t xhie             : 1;
  uint8_t ylie             : 1;
  uint8_t yhie             : 1;
  uint8_t zlie             : 1;
  uint8_t zhie             : 1;
} l3gd20h_gy_trshld_en_t;
int32_t l3gd20h_gy_trshld_axis_set(stmdev_ctx_t *ctx,
                                   l3gd20h_gy_trshld_en_t val);
int32_t l3gd20h_gy_trshld_axis_get(stmdev_ctx_t *ctx,
                                   l3gd20h_gy_trshld_en_t *val);

typedef struct {
  uint8_t xl             : 1;
  uint8_t xh             : 1;
  uint8_t yl             : 1;
  uint8_t yh             : 1;
  uint8_t zl             : 1;
  uint8_t zh             : 1;
  uint8_t ia             : 1;
} l3gd20h_gy_trshld_src_t;
int32_t l3gd20h_gy_trshld_src_get(stmdev_ctx_t *ctx,
                                  l3gd20h_gy_trshld_src_t *val);

int32_t l3gd20h_gy_trshld_x_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t l3gd20h_gy_trshld_x_get(stmdev_ctx_t *ctx, uint16_t *val);

typedef enum {
  L3GD20H_RESET_MODE       = 0x00,
  L3GD20H_DECREMENT_MODE   = 0x01,
} l3gd20h_dcrm_g_t;
int32_t l3gd20h_gy_trshld_mode_set(stmdev_ctx_t *ctx,
                                   l3gd20h_dcrm_g_t val);
int32_t l3gd20h_gy_trshld_mode_get(stmdev_ctx_t *ctx,
                                   l3gd20h_dcrm_g_t *val);

int32_t l3gd20h_gy_trshld_y_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t l3gd20h_gy_trshld_y_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t l3gd20h_gy_trshld_z_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t l3gd20h_gy_trshld_z_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t l3gd20h_gy_trshld_min_sample_set(stmdev_ctx_t *ctx,
                                         uint8_t val);
int32_t l3gd20h_gy_trshld_min_sample_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t l3gd20h_fifo_stop_on_wtm_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t l3gd20h_fifo_stop_on_wtm_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  L3GD20H_BYPASS_MODE              = 0x00,
  L3GD20H_FIFO_MODE                = 0x11,
  L3GD20H_STREAM_MODE              = 0x12,
  L3GD20H_STREAM_TO_FIFO_MODE      = 0x13,
  L3GD20H_BYPASS_TO_STREAM_MODE    = 0x14,
  L3GD20H_DYNAMIC_STREAM_MODE      = 0x16,
  L3GD20H_BYPASS_TO_FIFO_MODE      = 0x17,
} l3gd20h_fifo_m_t;
int32_t l3gd20h_fifo_mode_set(stmdev_ctx_t *ctx,
                              l3gd20h_fifo_m_t val);
int32_t l3gd20h_fifo_mode_get(stmdev_ctx_t *ctx,
                              l3gd20h_fifo_m_t *val);

int32_t l3gd20h_fifo_watermark_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t l3gd20h_fifo_watermark_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t fss             : 1;
  uint8_t empty           : 1;
  uint8_t ovrn            : 1;
  uint8_t fth             : 1;
} l3gd20h_fifo_srs_t;
int32_t l3gd20h_fifo_src_get(stmdev_ctx_t *ctx,
                             l3gd20h_fifo_srs_t *val);

int32_t l3gd20h_fifo_data_level_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t l3gd20h_fifo_full_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t l3gd20h_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  L3GD20H_DEN_DISABLE           = 0x00,
  L3GD20H_DEN_ON_LEVEL_TRIGGER  = 0x04,
  L3GD20H_DEN_ON_EDGE_TRIGGER   = 0x02,
  L3GD20H_DEN_IMPULSE_TRIGGER   = 0x05,
} l3gd20h_den_md_t;
int32_t l3gd20h_den_mode_set(stmdev_ctx_t *ctx, l3gd20h_den_md_t val);
int32_t l3gd20h_den_mode_get(stmdev_ctx_t *ctx,
                             l3gd20h_den_md_t *val);

typedef enum {
  L3GD20H_ST_DISABLE    = 0x00,
  L3GD20H_ST_POSITIVE   = 0x01,
  L3GD20H_ST_NEGATIVE   = 0x03,
} l3gd20h_st_t;
int32_t l3gd20h_gy_self_test_set(stmdev_ctx_t *ctx, l3gd20h_st_t val);
int32_t l3gd20h_gy_self_test_get(stmdev_ctx_t *ctx,
                                 l3gd20h_st_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* L3GD20H_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
